# FIT5196 Task 2 in Assessment 2
#### Student Name: Boyu Zhang
#### Student ID: 28491300

Date: XX/XX/XXXX

Version: 1.0

Environment: Python 3.6 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment here, e.g.,:
* pandas (for dataframe, included in Anaconda Python ) 
* re (for regular expression, included in Anaconda Python 3.6) 
* numpy (for numpy array, included in Anaconda Python 3.6)
* jellyfish (for vairous string similarity matching, obtained by `pip install jellyfish`)
* sklearn (as depency of recordlinkag, obtained by `conda install scikit-learn`)
* recordlinkage (for record matching operations, obatained by `pip install recordlinkage`)

## 1.  Import libraries

In [1]:
# Code to import libraries as you need in this assessment, e.g.,
import numpy as np
import pandas as pd
import re
import jellyfish
import recordlinkage

## 2. Load datasets and exploration

In [2]:
df2 = pd.read_csv('./Input/dataset2_integration.csv')
df1 = pd.read_csv('./dataset1_solution.csv')

In [3]:
df1.columns

Index(['Id', 'Title', 'Location', 'ContractType', 'ContractTime', 'Company',
       'Category', 'Salary per annum', 'SourceName', 'OpenDate', 'CloseDate'],
      dtype='object')

In [4]:
df2.columns

Index(['Id', 'Source Name', 'Title', 'location', 'Contract Type',
       'Contract Time', 'Company', 'Category', 'Salary per month', 'OpenDate',
       'CloseDate'],
      dtype='object')

It seems there are two schema level conflicst between the two datasets:
1. There are attributes with same semantics that are not aligned
2. The `Salary` column is inconsistent

## 3. Integrate Datasets

## 3.1 Resolve schema conflicts

First we realign the order of columns in dataset2 and change the unit of `Salary` column

In [5]:
#unify unit of salary and re-align columns by adjusting schema of dataset2
new_salary = df2['Salary per month'].astype(int)*12
df2.drop(columns='Salary per month',inplace=True)
df2.insert(loc=8,column='Salary per annum',value=new_salary)
source = df2['Source Name'] 
df2.drop(columns='Source Name',inplace=True)
df2.insert(loc=8,column='SourceName',value=source)
df2.rename(columns={'location':'Location','Contract Type':'ContractType','Contract Time':'ContractTime'},inplace=True)

Final check before concatenating two datasets:

In [6]:
df1.head()

,Id,Title,Location,ContractType,ContractTime,Company,Category,Salary per annum,SourceName,OpenDate,CloseDate
0,12612628,Engineering Systems Analyst,Dorking,non_specified,permanent,Gregory Martin International,Engineering Jobs,24996,cv-library.co.uk,2012-11-03 00:00:00,2012-12-03 00:00:00
1,12612830,Stress Engineer Glasgow,Glasgow,non_specified,permanent,Gregory Martin International,Engineering Jobs,30000,cv-library.co.uk,2013-01-08 15:00:00,2013-04-08 15:00:00
2,12612844,Modelling And Simulation Analyst,Hampshire,non_specified,permanent,Gregory Martin International,Engineering Jobs,30000,cv-library.co.uk,2013-07-26 15:00:00,2013-09-24 15:00:00
3,12613049,Engineering Systems Analyst / Mathematical Mod...,Surrey,non_specified,permanent,Gregory Martin International,Engineering Jobs,27504,cv-library.co.uk,2012-12-14 00:00:00,2013-03-14 00:00:00
4,12613647,"Pioneer, Miser Engineering Systems Analyst",Surrey,non_specified,permanent,Gregory Martin International,Engineering Jobs,24996,cv-library.co.uk,2013-10-25 00:00:00,2013-12-24 00:00:00

In [7]:
df2.head()

,Id,Title,Location,ContractType,ContractTime,Company,Category,Salary per annum,SourceName,OpenDate,CloseDate
0,69247680,Business Development Exec research / insight ...,London,ft,perm.,BOYCE RECRUITMENT,"PR, Advertising & Marketing Jobs",25500,jobs.guardian.co.uk,2012-03-01 15:00:00,2012-03-31 15:00:00
1,69247682,Audit Senior London,London,ft,contr.,Pro Finance,Finance & Accounting Jobs,43200,icaewjobs.com,2013-03-14 12:00:00,2013-04-13 12:00:00
2,69247685,PR & Social Media Account Executive Top Inter...,Central London,ft,perm.,ECOM RECRUITMENT LTD,"PR, Advertising & Marketing Jobs",23004,jobs.guardian.co.uk,2012-02-14 12:00:00,2012-03-15 12:00:00
3,69247688,Content Manager,London,ft,perm.,NAKAMA LONDON,"PR, Advertising & Marketing Jobs",24996,jobs.guardian.co.uk,2012-10-21 00:00:00,2012-12-20 00:00:00
4,69247694,AV PRODUCTION MANAGER,Worcestershire,ft,perm.,LIVE RECRUITMENT,"PR, Advertising & Marketing Jobs",27504,jobs.guardian.co.uk,2012-02-22 00:00:00,2012-04-22 00:00:00

## 3.2 Resolve data conflicts

### Inconsistence
It seems there are still inconsisent representation of same values in `ContractType` and `ContractTime` columns, as well as inconsistent caplital letters in `Company` column, we fix them now before checking duplication.

Otherwise it may be incorrectly regarded as different strings which will harm the accuracy of duplicates-dropping

In [8]:
df2.ContractType = df2.ContractType.map({'ft':'full_time','pt':'part_time',np.nan:'non_specified'})
df2.ContractTime = df2.ContractTime.map({'perm.':'permanent','contr.':'contract',np.nan:'non_specified'})
df2.Company = df2.Company.str.title()
df2.Title = df2.Title.str.title()#missing consistency, Title may not match with sample solution

### Duplication
- We should figure out a global key -- a set of features to identify whether two records are duplicated or not

In [9]:
#df1.set_index('Id',inplace=True)
#df2.set_index('Id',inplace=True)
#df1.index.rename('Id1',inplace=True)
#df2.index.rename('Id2',inplace=True)

### Then we should consider comparing similarity of records based on a set of features:
- We should pick out some features that we regard as identical for each record
- From the previous observation we can see that the `Title` of each record is unlikely to be highly similar to others, almost everything from "Year number" to "London" and "20K" can be included in.
- Also the precision of `Salary` is to the last digit, thus they shall be identical to certain extent as well

We need to confirm our inference based on statistics

In [10]:
# test uniqueness level of features in df1
cols = list(df1.columns)
for col in cols:
    print(df1[col].unique().shape[0],col)

25077 Id
25077 Title
477 Location
3 ContractType
3 ContractTime
4705 Company
8 Category
1570 Salary per annum
90 SourceName
2193 OpenDate
2400 CloseDate

In [11]:
# test uniqueness level of features in df2
cols = list(df2.columns)
for col in cols:
    print(df2[col].unique().shape[0],col)

25276 Id
25276 Title
475 Location
3 ContractType
3 ContractTime
5546 Company
8 Category
1505 Salary per annum
92 SourceName
2193 OpenDate
2395 CloseDate

#### Decision
So we pick the combination of features with the top level of uniqueness in both datasets:
`Title`,`Company`,`Salary per annum`,`OpenDate`,`CloseDate`

**One more tip**:

It is unsual that "np.nan == np.nan" will return **False**, we recall from task1 that there are quite a number of null values in df1 which will harm the performance of our deduplication process.

Thus we replace the null value with same string "Unknown"

In [12]:
df1.Company.fillna('Unknown',inplace=True)
df2.Company.fillna('Unknown',inplace=True)

### Create record pairs

First we need to check whether there are potential duplicated records in each dataset itself.

In [13]:
indexer = recordlinkage.BlockIndex(on=['Title','Company','Salary per annum','OpenDate','CloseDate'])
pairs = indexer.index(df1)
len(pairs)

0

In [14]:
indexer = recordlinkage.BlockIndex(on=['Title','Company','Salary per annum','OpenDate','CloseDate'])
pairs = indexer.index(df2)
len(pairs)

0

This means no potential duplicated records are found respectively in each dataset.

Then we need to find potential pairs in both datasets

In [15]:
indexer = recordlinkage.BlockIndex(on=['Title','Company','Salary per annum','OpenDate','CloseDate'])
pairs = indexer.index(df1,df2)
len(pairs)

191

Then we need to compute the simliarity of each record pairs

In [16]:
compare_cl = recordlinkage.Compare()

In [17]:
# get mean value of salary to provide reference to salary similarity comparison
df1['Salary per annum'].mean()

34364.17474179527

We set a few threshold on giving the similarity score, if similarity level exceeds the threshold, we give it 1, otherwise 0,

In [18]:
# Compute the similarity score of each selected feature between record pairs
compare_cl = recordlinkage.Compare()
# since the title is too customized we try not be too strict on them
compare_cl.string('Title','Title',threshold=0.6,method='levenshtein',label='Title')
#Company is not that unique, so we set higher threshold
compare_cl.string('Company','Company',threshold=0.8,label='Company')
# The salary comparison is based on gaussian distribution, the scale is based on the mean value
compare_cl.numeric('Salary per annum','Salary per annum',scale=1000,method='gauss',label='Salary')
compare_cl.string('OpenDate','OpenDate',threshold=0.95,label='OpenDate')
compare_cl.string('CloseDate','CloseDate',threshold=0.95,label='CloseDate')
features = compare_cl.compute(pairs, df1, df2)

In [19]:
#for all 5 features we regard two record with score higher than 4 as duplicated
matches = features[features.sum(axis=1) > 4]
matches

             Title  Company  Salary  OpenDate  CloseDate
92    23062    1.0      1.0     1.0       1.0        1.0
132   7781     1.0      1.0     1.0       1.0        1.0
164   5225     1.0      1.0     1.0       1.0        1.0
486   6809     1.0      1.0     1.0       1.0        1.0
816   19550    1.0      1.0     1.0       1.0        1.0
1040  16416    1.0      1.0     1.0       1.0        1.0
1067  1072     1.0      1.0     1.0       1.0        1.0
1078  4665     1.0      1.0     1.0       1.0        1.0
1127  17210    1.0      1.0     1.0       1.0        1.0
1157  8560     1.0      1.0     1.0       1.0        1.0
1209  1044     1.0      1.0     1.0       1.0        1.0
1431  22253    1.0      1.0     1.0       1.0        1.0
1450  19266    1.0      1.0     1.0       1.0        1.0
1460  13887    1.0      1.0     1.0       1.0        1.0
1657  17175    1.0      1.0     1.0       1.0        1.0
2056  18468    1.0      1.0     1.0       1.0        1.0
2127  21465    1.0      1.0     1.0       1.0        1.0
2129  21579    1.0      1.0     1.0       1.0        1.0
2360  17633    1.0      1.0     1.0       1.0        1.0
2493  8260     1.0      1.0     1.0       1.0        1.0
2618  17190    1.0      1.0     1.0       1.0        1.0
2652  4942     1.0      1.0     1.0       1.0        1.0
3039  24434    1.0      1.0     1.0       1.0        1.0
3165  14592    1.0      1.0     1.0       1.0        1.0
3232  14775    1.0      1.0     1.0       1.0        1.0
3563  10672    1.0      1.0     1.0       1.0        1.0
3700  3190     1.0      1.0     1.0       1.0        1.0
3813  6431     1.0      1.0     1.0       1.0        1.0
3915  5819     1.0      1.0     1.0       1.0        1.0
4357  15102    1.0      1.0     1.0       1.0        1.0
...            ...      ...     ...       ...        ...
19167 11551    1.0      1.0     1.0       1.0        1.0
19284 6342     1.0      1.0     1.0       1.0        1.0
19703 3729     1.0      1.0     1.0       1.0        1.0
19729 23191    1.0      1.0     1.0       1.0        1.0
19879 21742    1.0      1.0     1.0       1.0        1.0
19930 20465    1.0      1.0     1.0       1.0        1.0
20097 12398    1.0      1.0     1.0       1.0        1.0
20287 15775    1.0      1.0     1.0       1.0        1.0
20592 6032     1.0      1.0     1.0       1.0        1.0
21056 13237    1.0      1.0     1.0       1.0        1.0
21257 18010    1.0      1.0     1.0       1.0        1.0
21283 1528     1.0      1.0     1.0       1.0        1.0
21396 19320    1.0      1.0     1.0       1.0        1.0
21412 5292     1.0      1.0     1.0       1.0        1.0
21557 2378     1.0      1.0     1.0       1.0        1.0
21640 166      1.0      1.0     1.0       1.0        1.0
21687 11981    1.0      1.0     1.0       1.0        1.0
21846 18147    1.0      1.0     1.0       1.0        1.0
22064 4481     1.0      1.0     1.0       1.0        1.0
22095 1165     1.0      1.0     1.0       1.0        1.0
22117 8666     1.0      1.0     1.0       1.0        1.0
22308 5897     1.0      1.0     1.0       1.0        1.0
22512 11926    1.0      1.0     1.0       1.0        1.0
22867 9787     1.0      1.0     1.0       1.0        1.0
22995 15006    1.0      1.0     1.0       1.0        1.0
23349 16388    1.0      1.0     1.0       1.0        1.0
23796 819      1.0      1.0     1.0       1.0        1.0
24127 19334    1.0      1.0     1.0       1.0        1.0
24236 9431     1.0      1.0     1.0       1.0        1.0
24430 11933    1.0      1.0     1.0       1.0        1.0

[191 rows x 5 columns]

Let's have a quick check does the pair looks really close to each other?

In [20]:
df1.iloc[92]

Id                                          44363005
Title               Electrical / Mechanical Engineer
Location                                       Poole
ContractType                           non_specified
ContractTime                               permanent
Company                                Indigo 21 Ltd
Category                            Engineering Jobs
Salary per annum                               30000
SourceName                          cv-library.co.uk
OpenDate                         2012-09-01 00:00:00
CloseDate                        2012-11-30 00:00:00
Name: 92, dtype: object

In [21]:
df2.iloc[23062]

Id                                          72446581
Title               Electrical / Mechanical Engineer
Location                                       Poole
ContractType                           non_specified
ContractTime                               permanent
Company                                Indigo 21 Ltd
Category                            Engineering Jobs
Salary per annum                               30000
SourceName                          cv-library.co.uk
OpenDate                         2012-09-01 00:00:00
CloseDate                        2012-11-30 00:00:00
Name: 23062, dtype: object

Seems the result is not bad, so we can now regard these 73 records as duplicated so we can drop them in either dataset.

In [22]:
#get the list of ids for records to delete in df1(either way is valid)
id_to_delete = list(features.index.get_level_values(0))

In [23]:
#drop the duplicated rows in dataset1
df1 = df1.drop(index=id_to_delete)

Last check of no duplicated records detected

In [24]:
#last check of potential duplicated record pairs
pairs = indexer.index(df1,df2)
len(pairs)

0

In [25]:
#undo changes to make dataset looks the same as original
#df1.reset_index(level=0, inplace=True)
#df2.reset_index(level=0, inplace=True)

In [26]:
# combine 2 datasets
df = pd.concat((df1,df2))

In [27]:
# third check of no duplication existing after the merge of datasets
df.duplicated(['Title','Company','Salary per annum','OpenDate','CloseDate']).sum()

0

Since there are no more duplicates, we can output the file

In [28]:
#output
df.to_csv('./dataset1_dataset2_solution.csv',index=False)#missing index=False

## 4. Summary
There are various way(algorithms) of measure similarity of strings and numeric values, we need to make a lot of choices. Thus the result can be quite dependent on the measures and features we pick.
### Reference
 1. recordlinkage. Retrieved from http://recordlinkage.readthedocs.io/en/latest/notebooks/data_deduplication.html
 2. How to get index values pandas.Retrieved from: https://stackoverflow.com/questions/18358938/get-row-index-values-of-pandas-dataframe-as-list
 3. How to convert pandas index in a dataframe to a column? Retrieved from:https://stackoverflow.com/questions/20461165/how-to-convert-pandas-index-in-a-dataframe-to-a-column